{"absolute_url": "/opinion/251/united-states-v-depierre/", "blocked": false, "citation": {"case_name": "United States v. DePIERRE", "docket_number": "08-2101 ", "document_uris": ["/api/rest/v2/document/251/", "/api/rest/v2/document/1760/"], "federal_cite_one": "599 F.3d 25", "federal_cite_three": null, "federal_cite_two": null, "id": 251, "lexis_cite": null, "neutral_cite": null, "resource_uri": "/api/rest/v2/citation/251/", "scotus_early_cite": null, "specialty_cite_one": null, "state_cite_one": null, "state_cite_regional": null, "state_cite_three": null, "state_cite_two": null, "westlaw_cite": null}, "citation_count": 8, "court": "/api/rest/v2/jurisdiction/ca1/", "date_blocked": null, "date_filed": "2010-03-15", "date_modified": "2015-03-30T15:06:32.636992", "docket": "/api/rest/v2/docket/1956561/", "download_url": "http://www.ca1.uscourts.gov/pdf.opinions/08-2101P-01A.pdf", "extracted_by_ocr": false, "html": "", "html_lawbox": "<div>\n<center><b>599 F.3d 25 (2010)</b></center>\n<center><h1>UNITED STATES of America, Appellee,<br>\nv.<br>\nFrantz DePIERRE, Defendant, Appellant.</h1></center>\n<center>No. 08-2101.</center>\n<center><p><b>United States Court of Appeals, First Circuit.</b></p></center>\n<center>Heard February 4, 2010.</center>\n<center>Decided March 17, 2010.</center>\n<p><span class=\"star-pagination\">*26</span> Eduardo Masferrer, by appointment of the court, with whom Masferrer &amp; Associates was on brief for appellant.</p>\n<p>Randall E. Kromm, Assistant United States Attorney, with whom Michael K. Loucks, Acting United States Attorney, was on brief for appellee.</p>\n<p>Before LYNCH, Chief Judge, BOUDIN and HOWARD, Circuit Judges.</p>\n<p>BOUDIN, Circuit Judge.</p>\n<p>After selling drugs on two occasions to a government informant, Frantz DePierre was tried and convicted of distributing cocaine in powder form (in the first sale), 21 U.S.C. § 841(a)(1) (2006), and of distributing 50 grams or more of cocaine base (in the second), <i>id.,</i> which carries a ten-year minimum sentence, <i>id.</i> § 841(b)(1)(A)(iii). In reviewing DePierre's appeal, we begin with a brief overview of events, adding details in the discussion of individual claims of error.</p>\n<p>In January 2005, a confidential informant (\"CI\") working with government agents received a call from DePierre. According to the CI's later trial testimony, DePierre offered to sell the CI crack cocaine. The CI, himself a former drug dealer, had been working with agents to investigate firearm and drug sales in the Haitian community in and around Boston, and the CI and DePierre had had earlier contacts. In a follow-up recorded phone call by the CI, primarily concerning proposed gun purchases, DePierre confirmed that he had the \"cookies,\" a reference to crack according to the CI.<sup>[1]</sup></p>\n<p>The two men then agreed on a purchase by the CI of a quantity of powder cocaine, <span class=\"star-pagination\">*27</span> although DePierre confirmed that he could \"[c]hef [it] up,\" meaning to cook the powder into crack. <i>See </i><i>United States v. Santiago,</i> 566 F.3d 65, 68 (1st Cir.2009) (noting the meaning of \"chef it up\"). In early February 2005, the powder sale was completed, but the federal agents decided to invite a transaction involving crack, and further discussions between the CI and DePierre ensued, with the CI pressing for crack rather than powder and DePierre confirming that he could provide crack. In March, DePierre sold the CI 55.1 grams of crack.</p>\n<p>Following indictment, DePierre pled to one firearms charge, three other firearms charges were dismissed, and trial followed solely on the two drug charges. Without denying the two sales, DePierre urged he had been entrapped, principally as to the sale of cocaine base. The entrapment defense was submitted to the jury, which after a four-day trial rejected the defense and convicted DePierre on both charges. The judge sentenced DePierre to ten years in prison, the statutory minimum for a sale of 50 or more grams of cocaine base. DePierre now contests only the cocaine base conviction and the ultimate sentence, albeit on several different grounds.</p>\n<p>DePierre's main contention on appeal relates to the distinction between crack and cocaine base, critical at sentencing, but we start with DePierre's conviction. Here, he claims that the judge misinstructed the jury on his substantive entrapment defense and, relatedly, that the judge erred at sentencing in rejecting DePierre's counterpart claim that the government engaged in sentencing factor manipulation. Both arguments rest on the premise that DePierre sought only to sell powder cocaine but was wrongfully induced to sell crack.</p>\n<p>Although DePierre does not say that the evidence compelled the jury to accept the defense, a description of the evidence on both sides provides context for the misinstruction claim. DePierre had in his favor the facts that he initially delivered powder cocaine and that further contacts had to be made by the CI before crack was procured. One of the government agents testified candidly that he sent the CI back to renew his efforts precisely in order to see whether DePierre could be drawn into a sale of crack, carrying with it the prospect of a higher sentence.</p>\n<p>It may be this express admission that prompted the judge to submit to the jury the entrapment claim, an obligation that exists only where there is record evidence that \"fairly supports\" the claim. <i>United States v. Rodriguez,</i> 858 F.2d 809, 812-14 (1st Cir.1988). Whether this is such a case may be debatedthere is no rule that the agent must stop with the first crimebut it is hard to fault the trial judge for avoiding the risk that an appellate court might say later that the issue should have been left to the jury.</p>\n<p>Under the precedents, once the defendant makes a preliminary showing, the burden shifts to the government to prove beyond a reasonable doubt one of two things, <i>either</i> of which defeats the defense: that the government did not wrongfully induce the accused to engage in criminal conduct <i>or</i> that the accused had a predisposition to engage in such conduct absent the inducement. <i>Mathews v. United States,</i> 485 U.S. 58, 63, 108 S.Ct. 883, 99 L.Ed.2d 54 (1988); <i>Rodriguez,</i> 858 F.2d at 812, 814-15. Given the burden-shifting, the term \"defense\" may be thought to understate the government's full burden.</p>\n<p>However, in practical terms the defense is difficult for the defendant because the threshold that must be met to show <i>wrongful</i> inducement is a high one. By their nature, \"stings\" and other such long-permitted <span class=\"star-pagination\">*28</span> operations of law enforcement do \"induce\" crimes, if that word is used in its lay sense. But it is settled that only <i>undue</i> pressure or encouragement are forbidden. <i>United States v. Rogers,</i> 102 F.3d 641, 645 (1st Cir.1996); <i>United States v. Acosta,</i> 67 F.3d 334, 337-38 (1st Cir.1995). The reasons, <i>see generally </i><i>United States v. Gendron,</i> 18 F.3d 955, 961-62 (1st Cir. 1994) (Breyer, C.J.), are too familiar to require repetition.</p>\n<p>In this instance, the jury could easily reject the entrapment defense for lack of impropriety, because of propensity or both. If the CI were credited, DePierre's initial call <i>was</i> a proposal to sell crack; DePierre made clear that he could cook the powder into crack if desired; and although the CI made multiple phone calls to DePierre to set-up the two drug sales, no evidence indicates that the agents or the CI applied any undue pressure to secure the crack or even had to overcome resistance. The government's desire to establish the more serious crime may offend the fastidious, but inviting crime is the essence of sting operations. <i>Cf. </i><i>United States v. Terry,</i> 240 F.3d 65, 66-70 (1st Cir.2001); <i>United States v. Egemonye,</i> 62 F.3d 425, 427-28 (1st Cir.1995).</p>\n<p>Still, DePierre was entitled to have any instruction given be a proper one. He did not object to the original instruction nor to a summary definition thereafter given at the jury's request; but when the jury then asked for more guidance, the judge provided a written summary of the inducement and predisposition criteria. DePierre objected to the written summary's use of the word \"improperly\" to qualify the character of the government conduct required. The judge's summary said that the government must prove:</p>\n<blockquote>\n<i>One,</i> that the cooperating informant did not improperly persuade or talk the defendant into committing the crime. Simply giving someone an opportunity to commit a crime is not the same as improperly persuading him, but excessive pressure by the cooperating informant can be improper; OR</blockquote>\n<blockquote>\n<i>Two</i>[,] that the defendant was ready and willing to commit the crime without any improper persuasion from the cooperating individual.</blockquote>\n<p>Courts have had difficulty tailoring a useful abstract definition of what is wrongful inducementthis is equally true of \"reasonable doubt,\" <i>see </i><i>United States v. Whiting,</i> 28 F.3d 1296, 1303-04 (1st Cir. 1994)and have regularly resorted both to examples and to adjectives to illuminate the concept. In the original instruction in this case, to which no objection was taken, the district judge said, among other things, that entrapment requires \"some form of excessive pressure or some form of undue sympathy,\" and the court gave examples of permissible conduct to illustrate the difference between what was and was not entrapment.</p>\n<p>There was nothing wrong in using the term \"improper,\" and a number of our own decisions have done so. Thus, in <i>Santiago,</i> we said that the \"inducement\" prong requires \"a degree of pressure or ... other tactics that are improper.\" 566 F.3d at 58; <i>accord </i><i>Acosta,</i> 67 F.3d at 337. Apart from attacking the word \"improper,\" DePierre merely complains that the summary did not include examples. But the court earlier had given examples, and taking the charge on entrapment as a wholethe usual test, <i>United States v. Taylor,</i> 54 F.3d 967, 976 (1st Cir.1995)it fairly explained the concept to the jury.</p>\n<p>This brings us to DePierre's related claim of sentencing factor manipulation, which occurs when the government \"improperly enlarge[s] the scope or scale of [a] crime\" to secure a longer sentence than <span class=\"star-pagination\">*29</span> would otherwise obtain. <i>United States v. Vasco,</i> 564 F.3d 12, 24 (1st Cir.2009) (quoting <i>United States v. Fontes,</i> 415 F.3d 174, 180 (1st Cir.2005) (alterations in original)); <i>accord </i><i>United States v. Montoya,</i> 62 F.3d 1, 3-4, (1st Cir.1995). This claim and the entrapment defense have evident similarities; the claims may closely overlap in a single case (as they do here), and, confusingly, the term \"entrapment\" is sometimes used in describing the manipulation claim. <i>See </i><i>United States v. Connell,</i> 960 F.2d 191, 194 (1st Cir.1992) (noting the nomenclature problem).<sup>[2]</sup></p>\n<p>But the entrapment defense in federal courts dates back to the 1930s, <i>see </i><i>Sorrells v. United States,</i> 287 U.S. 435, 53 S.Ct. 210, 77 L.Ed. 413 (1932); 2 LaFave, <i>Substantive Criminal Law</i> § 9.8(a), at 88-89 (2d ed.2003), creates a jury issue and can result in an acquittal, <i>see </i><i>Acosta,</i> 67 F.3d at 337-38. Sentencing factor manipulation is a more recent concept in this circuit (and some others) by which the judge, not the jury, can adjust a sentence downward if the judge concludes that the government has improperly enlarged the scope or scale of the crime to secure a higher sentence. <i>See </i><i>Montoya,</i> 62 F.3d at 3-4; <i>Connell,</i> 960 F.2d at 194-97. The defendant bears the burden of making such a showing. <i>Jaca-Nazario,</i> 521 F.3d at 57.</p>\n<p>For sentencing factor manipulation, impropriety is the main focus, although predisposition is sometimes described as negating the claim, <i>Jaca-Nazario,</i> 521 F.3d at 58-59; <i>United States v. Gibbens,</i> 25 F.3d 28, 31 &amp; n. 3 (1st Cir.1994), and in this circuit the threshold is very high, <i>e.g.,</i> <i>United States v. Richardson,</i> 515 F.3d 74, 86 n. 8 (1st Cir.2008) (requiring \"an extreme and unusual case\" such as \"`outrageous and intolerable pressure' or `illegitimate motive on the part of the agents'\" (quoting <i>Montoya,</i> 62 F.3d at 4)); <i>Jaca-Nazario,</i> 521 F.3d at 58 (requiring \"extraordinary misconduct\").</p>\n<p>This comparatively high threshold owed something to concerns about undermining detailed statutory and guideline provisions designed to control variations in sentencing and, conversely, perhaps to a perception that ordinary entrapment doctrine has a close relationship to drawing the line between guilt and innocence, where courts are especially protective. <i>Montoya,</i> 62 F.3d at 4; 2 LaFave, <i>supra</i> § 9.8(b), at 95 n. 48 (discussing circuit case law). Under our precedents, the adjectives are part of the doctrine.</p>\n<p>In all events, there was no wrongful manipulation here under any phrasing of the standard. This is patent if the trial judge believed the CI's statement that DePierre himself offered crack in the first conversation; but in any case, the evidence already discussed shows that the CI exerted no real pressure, let alone undue pressure, to secure the sale of crack, which DePierre showed no hesitation in providing. We add that manipulation decisions by the sentencing judge are reviewed with deference, <i>Jaca-Nazario,</i> 521 F.3d at 57, but given the evidence, no deference is needed to sustain the decision here.</p>\n<p>This brings us to DePierre's main claim. The drug statute requires that to generate <span class=\"star-pagination\">*30</span> the mandatory minimum ten-year sentence, the sale or sales comprise 50 grams or more of \"cocaine base.\" 21 U.S.C. § 841(b)(1)(A)(iii). The jury was instructed to determine the nature and amount of the drug sold because these facts raise the statutory <i>maximum</i> for drug distribution and trigger the requirements of <i>Apprendi v. New Jersey,</i> 530 U.S. 466, 490, 120 S.Ct. 2348, 147 L.Ed.2d 435 (2000). DePierre's contention, which was preserved in the district court, is that the statute should be read to apply only to that form of cocaine base called crack, a position that some circuits have accepted.<sup>[3]</sup></p>\n<p>The statutory offense is defined as the sale (or other defined acts) of any amount of any drug comprising \"a controlled substance,\" 21 U.S.C. § 841(a), and the distinctions as to the type of controlled substance and the amount are primarily a concern of the statutory provisions defining \"[p]enalties,\" <i>id.</i> § 841(b); <i>United States v. Goodine,</i> 326 F.3d 26, 31-32 (1st Cir.2003). Because the sale of any form of cocaine in any amount permits a maximum sentence of 20 years, 21 U.S.C. § 841(b)(1)(C), DePierre's sentence would not have been an <i>Apprendi</i> violation regardless of whether the drug was crack or some other form of cocaine. <i>United States v. Lizardo,</i> 445 F.3d 73, 89-90 (1st Cir. 2006).</p>\n<p>However, the character of the drug could affect the judge's choice of sentences and, if the judge had wrongly classified the drug here at issue as one for which Congress had aimed at higher sentences, there might still be an error prejudicial to the defendant. But the instruction given by the judge accords with how this circuit has read the statutory term \"cocaine base,\" so there was no error in the instruction or in the verdict confirming that the drug was cocaine base within the meaning of the statute.</p>\n<p>Given the background supplied by <i>United States v. Robinson,</i> 144 F.3d 104, 108 (1st Cir.1998), it is enough to say here that the rock-like substance known as crack is the most familiar form of cocaine base, while powder cocaine is not cocaine base but rather is a salt, most commonly cocaine hydrochloride. <i>Id.</i> Although chemically similar (crack is made by cooking the powder form), Congress deemed crack far more dangerous in its effects on users and prescribed higher mandatory minimum and maximum sentences for sale of cocaine base than for other forms of cocaine. <i>United States v. Manzueta,</i> 167 F.3d 92, 94 (1st Cir.1999).</p>\n<p>DePierre, like others before him, argues that the statute although referring explicitly to \"cocaine base\" should be judicially restricted to only the specific form of cocaine base known as crack, which (admittedly) was the main focus of Congress' concern. As it happens, some evidence indicates the substance here was crack and at sentencing the judge repeatedly referred to it as crack; but to rely on that would needlessly raise an evidentiary issue that DePierre contests and also raise doubts about the continued vitality of binding circuit precedent as to the meaning of the statute.</p>\n<p>This circuit (along with a number of others) has read the statute according to its terms and held that \"cocaine base\" <span class=\"star-pagination\">*31</span> refers to \"all forms of cocaine base, including but not limited to crack cocaine.\" <i>United States v. Anderson,</i> 452 F.3d 66, 86-87 (1st Cir.2006).<sup>[4]</sup> Thus, the district court's instructions and the jury verdict accorded with our precedent, and the mandatory minimum sentence was properly imposed. This panel cannot overrule settled circuit precedent absent supervening authority or some other singular event. <i>Anderson,</i> 452 F.3d at 86.</p>\n<p>DePierre says that <i>Kimbrough v. United States,</i> 552 U.S. 85, 128 S.Ct. 558, 169 L.Ed.2d 481 (2007), discussing the disparity between powder cocaine and crack sentences, requires us to reconsider our view. But <i>Kimbrough</i> was concerned with sentencing guidelines that do use the term \"crack,\" and nothing it said involved a construction of the phrase \"cocaine base\" that triggers the statutory minimum sentence. <i>Kimbrough</i> uses the term \"cocaine base\" only once, calling \"[c]rack cocaine... a type of cocaine base.\" <i>Id.</i> at 94, 128 S.Ct. 558.</p>\n<p><i>Kimbrough</i> does also say that the statutory mandatory minimums under 21 U.S.C. § 841 that are at issue here apply to crack, 552 U.S. at 96, 128 S.Ct. 558, and that the statute \"criminaliz[es] the manufacture and distribution of crack cocaine,\" <i>id.</i> at 91, 128 S.Ct. 558, but these correct observations do not resolve the question whether the statutory minimums apply only to crack or rather to all forms of cocaine base. Because of the circuit split this issue does need resolution by the Supreme Court (at least in a case where its resolution matters); but <i>Kimbrough</i> does not address the issue, let alone decide it in DePierre's favor.</p>\n<p><i>Affirmed</i></p>\n<h2>NOTES</h2>\n<p>[1]  <i>See generally</i> Office of National Drug Control Policy, Street Terms: Drugs and the Drug Trade, Crack Cocaine, http://www.whitehouse drugpolicy.gov/streetterms/ByType.asp?int TypeID =2  (http://perma.cc/38BC-3U26)(last visited February 25, 2010) (listing \"cookies\" as a slang term for crack cocaine).</p>\n<p>[2]  Adding to the confusion, this circuit uses the phrases \"sentencing factor manipulation\" and \"sentencing entrapment\" interchangeably, <i>United States v. Jaca-Nazario,</i> 521 F.3d 50, 57 (1st Cir.2008), but other circuits vary, <i>e.g., </i><i>United States v. Garcia,</i> 79 F.3d 74, 75 (7th Cir.1996) (distinguishing between government inducement of a more serious crime and conduct merely increasing the defendant's sentence); <i>United States v. Jones,</i> 18 F.3d 1145, 1152-53 (4th Cir.1994) (sentencing entrapment implicates defendant's predisposition but manipulation does not).</p>\n<p>[3]  Circuits limiting \"cocaine base\" to only crack (or to crack and other types of smokable cocaine base) include <i>United States v. Higgins,</i> 557 F.3d 381, 394-96 (6th Cir.2009); <i>United States v. Edwards,</i> 397 F.3d 570, 575-77 (7th Cir.2005); <i>United States v. Vesey,</i> 330 F.3d 1070, 1073 (8th Cir.2003); <i>United States v. Hollis,</i> 490 F.3d 1149, 1155-57 (9th Cir. 2007); <i>United States v. Munoz-Realpe,</i> 21 F.3d 375, 377-78 (11th Cir.1994); and <i>United States v. Brisbane,</i> 367 F.3d 910, 912-14 (D.C.Cir.2004).</p>\n<p>[4]  In this circuit, see <i>United States v. Medina,</i> 427 F.3d 88, 92 (1st Cir.2005); <i>United States v. Richardson,</i> 225 F.3d 46, 49 (1st Cir.2000); and <i>United States v. Lopez-Gil,</i> 965 F.2d 1124, 1134-35 (1st Cir.1992) (opinion on rehearing). For other circuits of the same view, see <i>United States v. Jackson,</i> 968 F.2d 158, 162-63 (2d Cir.1992); <i>United States v. Barbosa,</i> 271 F.3d 438, 466-67 (3d Cir.2001); <i>United States v. Ramos,</i> 462 F.3d 329, 333-34 (4th Cir.2006); <i>United States v. Butler,</i> 988 F.2d 537, 542-43 (5th Cir.1993); and <i>United States v. Easter,</i> 981 F.2d 1549, 1558 &amp; n. 7 (10th Cir.1992).</p>\n\n</div>", "html_with_citations": "<div>\n<center><b><span class=\"citation no-link\"><span class=\"volume\">599</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">25</span></span> (2010)</b></center>\n<center><h1>UNITED STATES of America, Appellee,<br>\nv.<br>\nFrantz DePIERRE, Defendant, Appellant.</h1></center>\n<center>No. 08-2101.</center>\n<center><p><b>United States Court of Appeals, First Circuit.</b></p></center>\n<center>Heard February 4, 2010.</center>\n<center>Decided March 17, 2010.</center>\n<p><span class=\"star-pagination\">*26</span> Eduardo Masferrer, by appointment of the court, with whom Masferrer &amp; Associates was on brief for appellant.</p>\n<p>Randall E. Kromm, Assistant United States Attorney, with whom Michael K. Loucks, Acting United States Attorney, was on brief for appellee.</p>\n<p>Before LYNCH, Chief Judge, BOUDIN and HOWARD, Circuit Judges.</p>\n<p>BOUDIN, Circuit Judge.</p>\n<p>After selling drugs on two occasions to a government informant, Frantz DePierre was tried and convicted of distributing cocaine in powder form (in the first sale), 21 U.S.C. § 841(a)(1) (2006), and of distributing 50 grams or more of cocaine base (in the second), <i>id.,</i> which carries a ten-year minimum sentence, <i>id.</i> § 841(b)(1)(A)(iii). In reviewing DePierre's appeal, we begin with a brief overview of events, adding details in the discussion of individual claims of error.</p>\n<p>In January 2005, a confidential informant (\"CI\") working with government agents received a call from DePierre. According to the CI's later trial testimony, DePierre offered to sell the CI crack cocaine. The CI, himself a former drug dealer, had been working with agents to investigate firearm and drug sales in the Haitian community in and around Boston, and the CI and DePierre had had earlier contacts. In a follow-up recorded phone call by the CI, primarily concerning proposed gun purchases, DePierre confirmed that he had the \"cookies,\" a reference to crack according to the CI.<sup>[1]</sup></p>\n<p>The two men then agreed on a purchase by the CI of a quantity of powder cocaine, <span class=\"star-pagination\">*27</span> although DePierre confirmed that he could \"[c]hef [it] up,\" meaning to cook the powder into crack. <i>See </i><i>United States v. Santiago,</i> <span class=\"citation\" data-id=\"203832\"><a href=\"/opinion/203832/united-states-v-santiago/\"><span class=\"volume\">566</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">65</span></a></span>, 68 (1st Cir.2009) (noting the meaning of \"chef it up\"). In early February 2005, the powder sale was completed, but the federal agents decided to invite a transaction involving crack, and further discussions between the CI and DePierre ensued, with the CI pressing for crack rather than powder and DePierre confirming that he could provide crack. In March, DePierre sold the CI 55.1 grams of crack.</p>\n<p>Following indictment, DePierre pled to one firearms charge, three other firearms charges were dismissed, and trial followed solely on the two drug charges. Without denying the two sales, DePierre urged he had been entrapped, principally as to the sale of cocaine base. The entrapment defense was submitted to the jury, which after a four-day trial rejected the defense and convicted DePierre on both charges. The judge sentenced DePierre to ten years in prison, the statutory minimum for a sale of 50 or more grams of cocaine base. DePierre now contests only the cocaine base conviction and the ultimate sentence, albeit on several different grounds.</p>\n<p>DePierre's main contention on appeal relates to the distinction between crack and cocaine base, critical at sentencing, but we start with DePierre's conviction. Here, he claims that the judge misinstructed the jury on his substantive entrapment defense and, relatedly, that the judge erred at sentencing in rejecting DePierre's counterpart claim that the government engaged in sentencing factor manipulation. Both arguments rest on the premise that DePierre sought only to sell powder cocaine but was wrongfully induced to sell crack.</p>\n<p>Although DePierre does not say that the evidence compelled the jury to accept the defense, a description of the evidence on both sides provides context for the misinstruction claim. DePierre had in his favor the facts that he initially delivered powder cocaine and that further contacts had to be made by the CI before crack was procured. One of the government agents testified candidly that he sent the CI back to renew his efforts precisely in order to see whether DePierre could be drawn into a sale of crack, carrying with it the prospect of a higher sentence.</p>\n<p>It may be this express admission that prompted the judge to submit to the jury the entrapment claim, an obligation that exists only where there is record evidence that \"fairly supports\" the claim. <i>United States v. Rodriguez,</i> <span class=\"citation\" data-id=\"512578\"><a href=\"/opinion/512578/united-states-v-felix-rodriguez/\"><span class=\"volume\">858</span> <span class=\"reporter\">F.2d</span> <span class=\"page\">809</span></a></span>, 812-14 (1st Cir.1988). Whether this is such a case may be debatedthere is no rule that the agent must stop with the first crimebut it is hard to fault the trial judge for avoiding the risk that an appellate court might say later that the issue should have been left to the jury.</p>\n<p>Under the precedents, once the defendant makes a preliminary showing, the burden shifts to the government to prove beyond a reasonable doubt one of two things, <i>either</i> of which defeats the defense: that the government did not wrongfully induce the accused to engage in criminal conduct <i>or</i> that the accused had a predisposition to engage in such conduct absent the inducement. <i>Mathews v. United States,</i> <span class=\"citation\" data-id=\"112012\"><a href=\"/opinion/112012/mathews-v-united-states/\"><span class=\"volume\">485</span> <span class=\"reporter\">U.S.</span> <span class=\"page\">58</span></a></span>, 63, 108 S.Ct. 883, 99 L.Ed.2d 54 (1988); <i>Rodriguez,</i> 858 F.2d at 812, 814-15. Given the burden-shifting, the term \"defense\" may be thought to understate the government's full burden.</p>\n<p>However, in practical terms the defense is difficult for the defendant because the threshold that must be met to show <i>wrongful</i> inducement is a high one. By their nature, \"stings\" and other such long-permitted <span class=\"star-pagination\">*28</span> operations of law enforcement do \"induce\" crimes, if that word is used in its lay sense. But it is settled that only <i>undue</i> pressure or encouragement are forbidden. <i>United States v. Rogers,</i> <span class=\"citation\" data-id=\"197136\"><a href=\"/opinion/197136/united-states-v-rogers/\"><span class=\"volume\">102</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">641</span></a></span>, 645 (1st Cir.1996); <i>United States v. Acosta,</i> <span class=\"citation\" data-id=\"196327\"><a href=\"/opinion/196327/united-states-v-acosta/\"><span class=\"volume\">67</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">334</span></a></span>, 337-38 (1st Cir.1995). The reasons, <i>see generally </i><i>United States v. Gendron,</i> <span class=\"citation\" data-id=\"195225\"><a href=\"/opinion/195225/united-states-v-gendron/\"><span class=\"volume\">18</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">955</span></a></span>, 961-62 (1st Cir. 1994) (Breyer, C.J.), are too familiar to require repetition.</p>\n<p>In this instance, the jury could easily reject the entrapment defense for lack of impropriety, because of propensity or both. If the CI were credited, DePierre's initial call <i>was</i> a proposal to sell crack; DePierre made clear that he could cook the powder into crack if desired; and although the CI made multiple phone calls to DePierre to set-up the two drug sales, no evidence indicates that the agents or the CI applied any undue pressure to secure the crack or even had to overcome resistance. The government's desire to establish the more serious crime may offend the fastidious, but inviting crime is the essence of sting operations. <i>Cf. </i><i>United States v. Terry,</i> <span class=\"citation\" data-id=\"772069\"><a href=\"/opinion/772069/united-states-v-kenneth-b-terry-aka-kenny-polo/\"><span class=\"volume\">240</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">65</span></a></span>, 66-70 (1st Cir.2001); <i>United States v. Egemonye,</i> <span class=\"citation\" data-id=\"196220\"><a href=\"/opinion/196220/united-states-v-egemonye/\"><span class=\"volume\">62</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">425</span></a></span>, 427-28 (1st Cir.1995).</p>\n<p>Still, DePierre was entitled to have any instruction given be a proper one. He did not object to the original instruction nor to a summary definition thereafter given at the jury's request; but when the jury then asked for more guidance, the judge provided a written summary of the inducement and predisposition criteria. DePierre objected to the written summary's use of the word \"improperly\" to qualify the character of the government conduct required. The judge's summary said that the government must prove:</p>\n<blockquote>\n<i>One,</i> that the cooperating informant did not improperly persuade or talk the defendant into committing the crime. Simply giving someone an opportunity to commit a crime is not the same as improperly persuading him, but excessive pressure by the cooperating informant can be improper; OR</blockquote>\n<blockquote>\n<i>Two</i>[,] that the defendant was ready and willing to commit the crime without any improper persuasion from the cooperating individual.</blockquote>\n<p>Courts have had difficulty tailoring a useful abstract definition of what is wrongful inducementthis is equally true of \"reasonable doubt,\" <i>see </i><i>United States v. Whiting,</i> <span class=\"citation\" data-id=\"673817\"><a href=\"/opinion/673817/united-states-v-darryl-whiting-aka-g-god-rah-unite/\"><span class=\"volume\">28</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">1296</span></a></span>, 1303-04 (1st Cir. 1994)and have regularly resorted both to examples and to adjectives to illuminate the concept. In the original instruction in this case, to which no objection was taken, the district judge said, among other things, that entrapment requires \"some form of excessive pressure or some form of undue sympathy,\" and the court gave examples of permissible conduct to illustrate the difference between what was and was not entrapment.</p>\n<p>There was nothing wrong in using the term \"improper,\" and a number of our own decisions have done so. Thus, in <i>Santiago,</i> we said that the \"inducement\" prong requires \"a degree of pressure or ... other tactics that are improper.\" 566 F.3d at 58; <i>accord </i><i>Acosta,</i> 67 F.3d at 337. Apart from attacking the word \"improper,\" DePierre merely complains that the summary did not include examples. But the court earlier had given examples, and taking the charge on entrapment as a wholethe usual test, <i>United States v. Taylor,</i> <span class=\"citation\" data-id=\"196070\"><a href=\"/opinion/196070/united-states-v-taylor/\"><span class=\"volume\">54</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">967</span></a></span>, 976 (1st Cir.1995)it fairly explained the concept to the jury.</p>\n<p>This brings us to DePierre's related claim of sentencing factor manipulation, which occurs when the government \"improperly enlarge[s] the scope or scale of [a] crime\" to secure a longer sentence than <span class=\"star-pagination\">*29</span> would otherwise obtain. <i>United States v. Vasco,</i> <span class=\"citation\" data-id=\"203776\"><a href=\"/opinion/203776/united-states-v-vasco/\"><span class=\"volume\">564</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">12</span></a></span>, 24 (1st Cir.2009) (quoting <i>United States v. Fontes,</i> <span class=\"citation\" data-id=\"201714\"><a href=\"/opinion/201714/united-states-v-gomes-fontes/\"><span class=\"volume\">415</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">174</span></a></span>, 180 (1st Cir.2005) (alterations in original)); <i>accord </i><i>United States v. Montoya,</i> <span class=\"citation\" data-id=\"196205\"><a href=\"/opinion/196205/united-states-v-montoya/\"><span class=\"volume\">62</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">1</span></a></span>, 3-4, (1st Cir.1995). This claim and the entrapment defense have evident similarities; the claims may closely overlap in a single case (as they do here), and, confusingly, the term \"entrapment\" is sometimes used in describing the manipulation claim. <i>See </i><i>United States v. Connell,</i> <span class=\"citation\" data-id=\"580693\"><a href=\"/opinion/580693/united-states-v-gerald-connell/\"><span class=\"volume\">960</span> <span class=\"reporter\">F.2d</span> <span class=\"page\">191</span></a></span>, 194 (1st Cir.1992) (noting the nomenclature problem).<sup>[2]</sup></p>\n<p>But the entrapment defense in federal courts dates back to the 1930s, <i>see </i><i>Sorrells v. United States,</i> <span class=\"citation\" data-id=\"101997\"><a href=\"/opinion/101997/sorrells-v-united-states/\"><span class=\"volume\">287</span> <span class=\"reporter\">U.S.</span> <span class=\"page\">435</span></a></span>, 53 S.Ct. 210, 77 L.Ed. 413 (1932); 2 LaFave, <i>Substantive Criminal Law</i> § 9.8(a), at 88-89 (2d ed.2003), creates a jury issue and can result in an acquittal, <i>see </i><i>Acosta,</i> 67 F.3d at 337-38. Sentencing factor manipulation is a more recent concept in this circuit (and some others) by which the judge, not the jury, can adjust a sentence downward if the judge concludes that the government has improperly enlarged the scope or scale of the crime to secure a higher sentence. <i>See </i><i>Montoya,</i> 62 F.3d at 3-4; <i>Connell,</i> 960 F.2d at 194-97. The defendant bears the burden of making such a showing. <i>Jaca-Nazario,</i> 521 F.3d at 57.</p>\n<p>For sentencing factor manipulation, impropriety is the main focus, although predisposition is sometimes described as negating the claim, <i>Jaca-Nazario,</i> 521 F.3d at 58-59; <i>United States v. Gibbens,</i> <span class=\"citation\" data-id=\"195396\"><a href=\"/opinion/195396/united-states-v-gibbens/\"><span class=\"volume\">25</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">28</span></a></span>, 31 &amp; n. 3 (1st Cir.1994), and in this circuit the threshold is very high, <i>e.g.,</i> <i>United States v. Richardson,</i> <span class=\"citation\" data-id=\"203173\"><a href=\"/opinion/203173/united-states-v-richardson/\"><span class=\"volume\">515</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">74</span></a></span>, 86 n. 8 (1st Cir.2008) (requiring \"an extreme and unusual case\" such as \"`outrageous and intolerable pressure' or `illegitimate motive on the part of the agents'\" (quoting <i>Montoya,</i> 62 F.3d at 4)); <i>Jaca-Nazario,</i> 521 F.3d at 58 (requiring \"extraordinary misconduct\").</p>\n<p>This comparatively high threshold owed something to concerns about undermining detailed statutory and guideline provisions designed to control variations in sentencing and, conversely, perhaps to a perception that ordinary entrapment doctrine has a close relationship to drawing the line between guilt and innocence, where courts are especially protective. <i>Montoya,</i> 62 F.3d at 4; 2 LaFave, <i>supra</i> § 9.8(b), at 95 n. 48 (discussing circuit case law). Under our precedents, the adjectives are part of the doctrine.</p>\n<p>In all events, there was no wrongful manipulation here under any phrasing of the standard. This is patent if the trial judge believed the CI's statement that DePierre himself offered crack in the first conversation; but in any case, the evidence already discussed shows that the CI exerted no real pressure, let alone undue pressure, to secure the sale of crack, which DePierre showed no hesitation in providing. We add that manipulation decisions by the sentencing judge are reviewed with deference, <i>Jaca-Nazario,</i> 521 F.3d at 57, but given the evidence, no deference is needed to sustain the decision here.</p>\n<p>This brings us to DePierre's main claim. The drug statute requires that to generate <span class=\"star-pagination\">*30</span> the mandatory minimum ten-year sentence, the sale or sales comprise 50 grams or more of \"cocaine base.\" 21 U.S.C. § 841(b)(1)(A)(iii). The jury was instructed to determine the nature and amount of the drug sold because these facts raise the statutory <i>maximum</i> for drug distribution and trigger the requirements of <i>Apprendi v. New Jersey,</i> <span class=\"citation\" data-id=\"118381\"><a href=\"/opinion/118381/apprendi-v-new-jersey/\"><span class=\"volume\">530</span> <span class=\"reporter\">U.S.</span> <span class=\"page\">466</span></a></span>, 490, 120 S.Ct. 2348, 147 L.Ed.2d 435 (2000). DePierre's contention, which was preserved in the district court, is that the statute should be read to apply only to that form of cocaine base called crack, a position that some circuits have accepted.<sup>[3]</sup></p>\n<p>The statutory offense is defined as the sale (or other defined acts) of any amount of any drug comprising \"a controlled substance,\" 21 U.S.C. § 841(a), and the distinctions as to the type of controlled substance and the amount are primarily a concern of the statutory provisions defining \"[p]enalties,\" <i>id.</i> § 841(b); <i>United States v. Goodine,</i> <span class=\"citation\" data-id=\"781604\"><a href=\"/opinion/781604/united-states-v-brian-goodine-aka-dwayne-goodine/\"><span class=\"volume\">326</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">26</span></a></span>, 31-32 (1st Cir.2003). Because the sale of any form of cocaine in any amount permits a maximum sentence of 20 years, 21 U.S.C. § 841(b)(1)(C), DePierre's sentence would not have been an <i>Apprendi</i> violation regardless of whether the drug was crack or some other form of cocaine. <i>United States v. Lizardo,</i> <span class=\"citation\" data-id=\"202178\"><a href=\"/opinion/202178/united-states-v-lizardo/\"><span class=\"volume\">445</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">73</span></a></span>, 89-90 (1st Cir. 2006).</p>\n<p>However, the character of the drug could affect the judge's choice of sentences and, if the judge had wrongly classified the drug here at issue as one for which Congress had aimed at higher sentences, there might still be an error prejudicial to the defendant. But the instruction given by the judge accords with how this circuit has read the statutory term \"cocaine base,\" so there was no error in the instruction or in the verdict confirming that the drug was cocaine base within the meaning of the statute.</p>\n<p>Given the background supplied by <i>United States v. Robinson,</i> <span class=\"citation\" data-id=\"197938\"><a href=\"/opinion/197938/united-states-v-robinson/\"><span class=\"volume\">144</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">104</span></a></span>, 108 (1st Cir.1998), it is enough to say here that the rock-like substance known as crack is the most familiar form of cocaine base, while powder cocaine is not cocaine base but rather is a salt, most commonly cocaine hydrochloride. <i>Id.</i> Although chemically similar (crack is made by cooking the powder form), Congress deemed crack far more dangerous in its effects on users and prescribed higher mandatory minimum and maximum sentences for sale of cocaine base than for other forms of cocaine. <i>United States v. Manzueta,</i> <span class=\"citation\" data-id=\"198327\"><a href=\"/opinion/198327/united-states-v-manzueta/\"><span class=\"volume\">167</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">92</span></a></span>, 94 (1st Cir.1999).</p>\n<p>DePierre, like others before him, argues that the statute although referring explicitly to \"cocaine base\" should be judicially restricted to only the specific form of cocaine base known as crack, which (admittedly) was the main focus of Congress' concern. As it happens, some evidence indicates the substance here was crack and at sentencing the judge repeatedly referred to it as crack; but to rely on that would needlessly raise an evidentiary issue that DePierre contests and also raise doubts about the continued vitality of binding circuit precedent as to the meaning of the statute.</p>\n<p>This circuit (along with a number of others) has read the statute according to its terms and held that \"cocaine base\" <span class=\"star-pagination\">*31</span> refers to \"all forms of cocaine base, including but not limited to crack cocaine.\" <i>United States v. Anderson,</i> <span class=\"citation\" data-id=\"202292\"><a href=\"/opinion/202292/united-states-v-anderson/\"><span class=\"volume\">452</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">66</span></a></span>, 86-87 (1st Cir.2006).<sup>[4]</sup> Thus, the district court's instructions and the jury verdict accorded with our precedent, and the mandatory minimum sentence was properly imposed. This panel cannot overrule settled circuit precedent absent supervening authority or some other singular event. <i>Anderson,</i> 452 F.3d at 86.</p>\n<p>DePierre says that <i>Kimbrough v. United States,</i> <span class=\"citation\" data-id=\"145841\"><a href=\"/opinion/145841/kimbrough-v-united-states/\"><span class=\"volume\">552</span> <span class=\"reporter\">U.S.</span> <span class=\"page\">85</span></a></span>, 128 S.Ct. 558, 169 L.Ed.2d 481 (2007), discussing the disparity between powder cocaine and crack sentences, requires us to reconsider our view. But <i>Kimbrough</i> was concerned with sentencing guidelines that do use the term \"crack,\" and nothing it said involved a construction of the phrase \"cocaine base\" that triggers the statutory minimum sentence. <i>Kimbrough</i> uses the term \"cocaine base\" only once, calling \"[c]rack cocaine... a type of cocaine base.\" <i>Id.</i> at 94, 128 S.Ct. 558.</p>\n<p><i>Kimbrough</i> does also say that the statutory mandatory minimums under 21 U.S.C. § 841 that are at issue here apply to crack, 552 U.S. at 96, 128 S.Ct. 558, and that the statute \"criminaliz[es] the manufacture and distribution of crack cocaine,\" <i>id.</i> at 91, 128 S.Ct. 558, but these correct observations do not resolve the question whether the statutory minimums apply only to crack or rather to all forms of cocaine base. Because of the circuit split this issue does need resolution by the Supreme Court (at least in a case where its resolution matters); but <i>Kimbrough</i> does not address the issue, let alone decide it in DePierre's favor.</p>\n<p><i>Affirmed</i></p>\n<h2>NOTES</h2>\n<p>[1]  <i>See generally</i> Office of National Drug Control Policy, Street Terms: Drugs and the Drug Trade, Crack Cocaine, http://www.whitehouse drugpolicy.gov/streetterms/ByType.asp?int TypeID =2  (http://perma.cc/XR8X-23FN)(last visited February 25, 2010) (listing \"cookies\" as a slang term for crack cocaine).</p>\n<p>[2]  Adding to the confusion, this circuit uses the phrases \"sentencing factor manipulation\" and \"sentencing entrapment\" interchangeably, <i>United States v. Jaca-Nazario,</i> <span class=\"citation\" data-id=\"203208\"><a href=\"/opinion/203208/united-states-v-jaca-nazario/\"><span class=\"volume\">521</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">50</span></a></span>, 57 (1st Cir.2008), but other circuits vary, <i>e.g., </i><i>United States v. Garcia,</i> <span class=\"citation\" data-id=\"714908\"><a href=\"/opinion/714908/united-states-v-rodolfo-garcia-also-known-as-rafae/\"><span class=\"volume\">79</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">74</span></a></span>, 75 (7th Cir.1996) (distinguishing between government inducement of a more serious crime and conduct merely increasing the defendant's sentence); <i>United States v. Jones,</i> <span class=\"citation\" data-id=\"664902\"><a href=\"/opinion/664902/united-states-v-darla-denean-jones-united-states-o/\"><span class=\"volume\">18</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">1145</span></a></span>, 1152-53 (4th Cir.1994) (sentencing entrapment implicates defendant's predisposition but manipulation does not).</p>\n<p>[3]  Circuits limiting \"cocaine base\" to only crack (or to crack and other types of smokable cocaine base) include <i>United States v. Higgins,</i> <span class=\"citation\" data-id=\"1433517\"><a href=\"/opinion/1433517/united-states-v-higgins/\"><span class=\"volume\">557</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">381</span></a></span>, 394-96 (6th Cir.2009); <i>United States v. Edwards,</i> <span class=\"citation\" data-id=\"789180\"><a href=\"/opinion/789180/united-states-v-carl-edwards/\"><span class=\"volume\">397</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">570</span></a></span>, 575-77 (7th Cir.2005); <i>United States v. Vesey,</i> <span class=\"citation\" data-id=\"782168\"><a href=\"/opinion/782168/united-states-v-arthur-vesey/\"><span class=\"volume\">330</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">1070</span></a></span>, 1073 (8th Cir.2003); <i>United States v. Hollis,</i> <span class=\"citation\" data-id=\"798147\"><a href=\"/opinion/798147/united-states-v-arthur-l-hollis/\"><span class=\"volume\">490</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">1149</span></a></span>, 1155-57 (9th Cir. 2007); <i>United States v. Munoz-Realpe,</i> <span class=\"citation\" data-id=\"667246\"><a href=\"/opinion/667246/united-states-v-jose-domingo-munoz-realpe/\"><span class=\"volume\">21</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">375</span></a></span>, 377-78 (11th Cir.1994); and <i>United States v. Brisbane,</i> <span class=\"citation\" data-id=\"186206\"><a href=\"/opinion/186206/united-states-v-brisbane-george/\"><span class=\"volume\">367</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">910</span></a></span>, 912-14 (D.C.Cir.2004).</p>\n<p>[4]  In this circuit, see <i>United States v. Medina,</i> <span class=\"citation\" data-id=\"201882\"><a href=\"/opinion/201882/united-states-v-medina/\"><span class=\"volume\">427</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">88</span></a></span>, 92 (1st Cir.2005); <i>United States v. Richardson,</i> <span class=\"citation\" data-id=\"199073\"><a href=\"/opinion/199073/united-states-v-richardson/\"><span class=\"volume\">225</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">46</span></a></span>, 49 (1st Cir.2000); and <i>United States v. Lopez-Gil,</i> <span class=\"citation\" data-id=\"584140\"><a href=\"/opinion/584140/united-states-v-jesus-m-lopez-gil/\"><span class=\"volume\">965</span> <span class=\"reporter\">F.2d</span> <span class=\"page\">1124</span></a></span>, 1134-35 (1st Cir.1992) (opinion on rehearing). For other circuits of the same view, see <i>United States v. Jackson,</i> <span class=\"citation\" data-id=\"586293\"><a href=\"/opinion/586293/united-states-v-frank-jackson/\"><span class=\"volume\">968</span> <span class=\"reporter\">F.2d</span> <span class=\"page\">158</span></a></span>, 162-63 (2d Cir.1992); <i>United States v. Barbosa,</i> <span class=\"citation\" data-id=\"775561\"><a href=\"/opinion/775561/united-states-v-luis-humberto-barbosa/\"><span class=\"volume\">271</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">438</span></a></span>, 466-67 (3d Cir.2001); <i>United States v. Ramos,</i> <span class=\"citation\" data-id=\"795619\"><a href=\"/opinion/795619/united-states-v-raul-castillo-ramos/\"><span class=\"volume\">462</span> <span class=\"reporter\">F.3d</span> <span class=\"page\">329</span></a></span>, 333-34 (4th Cir.2006); <i>United States v. Butler,</i> <span class=\"citation\" data-id=\"602377\"><a href=\"/opinion/602377/united-states-v-roland-eugene-butler/\"><span class=\"volume\">988</span> <span class=\"reporter\">F.2d</span> <span class=\"page\">537</span></a></span>, 542-43 (5th Cir.1993); and <i>United States v. Easter,</i> <span class=\"citation no-link\"><span class=\"volume\">981</span> <span class=\"reporter\">F.2d</span> <span class=\"page\">1549</span></span>, 1558 &amp; n. 7 (10th Cir.1992).</p>\n\n</div>", "id": 251, "judges": "Lynch, Chief Judge, Boudin and Howard, Circuit Judges", "local_path": "pdf/2010/03/15/US_v._DePierre.pdf", "nature_of_suit": "", "plain_text": "          United States Court of Appeals\n                     For the First Circuit\n\nNo. 08-2101\n\n                    UNITED STATES OF AMERICA,\n\n                            Appellee,\n\n                               v.\n\n                        FRANTZ DePIERRE,\n\n                      Defendant, Appellant.\n\n\n          APPEAL FROM THE UNITED STATES DISTRICT COURT\n\n                FOR THE DISTRICT OF MASSACHUSETTS\n\n         [Hon. Douglas P. Woodlock, U.S. District Judge]\n\n\n                             Before\n\n                       Lynch, Chief Judge,\n\n               Boudin and Howard, Circuit Judges.\n\n\n     Eduardo Masferrer, by appointment of the court, with whom\nMasferrer & Associates was on brief for appellant.\n     Randall E. Kromm, Assistant United States Attorney, with whom\nMichael K. Loucks, Acting United States Attorney, was on brief for\nappellee.\n\n\n\n                         March 17, 2010\n           BOUDIN, Circuit Judge.     After selling drugs on two\n\noccasions to a government informant, Frantz DePierre was tried and\n\nconvicted of distributing cocaine in powder form (in the first\n\nsale), 21 U.S.C. § 841(a)(1) (2006), and of distributing 50 grams\n\nor more of cocaine base (in the second), id., which carries a ten-\n\nyear minimum sentence, id. § 841(b)(1)(A)(iii).       In reviewing\n\nDePierre's appeal, we begin with a brief overview of events, adding\n\ndetails in the discussion of individual claims of error.\n\n           In January 2005, a confidential informant (\"CI\") working\n\nwith government agents received a call from DePierre. According to\n\nthe CI's later trial testimony, DePierre offered to sell the CI\n\ncrack cocaine.   The CI, himself a former drug dealer, had been\n\nworking with agents to investigate firearm and drug sales in the\n\nHaitian community in and around Boston, and the CI and DePierre had\n\nhad earlier contacts.   In a follow-up recorded phone call by the\n\nCI, primarily concerning proposed gun purchases, DePierre confirmed\n\nthat he had the \"cookies,\" a reference to crack according to the\n\nCI.1\n\n           The two men then agreed on a purchase by the CI of a\n\nquantity of powder cocaine, although DePierre confirmed that he\n\ncould \"[c]hef [it] up,\" meaning to cook the powder into crack.   See\n\n\n       1\n      See generally Office of National Drug Control Policy, Street\nTerms:    Drugs    and   the    Drug    Trade,   Crack    Cocaine,\nhttp://www.whitehousedrugpolicy.gov/streetterms/ByType.asp?intTyp\neID=2 (last visited February 25, 2010) (listing \"cookies\" as a\nslang term for crack cocaine).\n\n                                -2-\nUnited States v. Santiago, 566 F.3d 65, 68 (1st Cir. 2009) (noting\n\nthe meaning of \"chef it up\").           In early February 2005, the powder\n\nsale was completed, but the federal agents decided to invite a\n\ntransaction involving crack, and further discussions between the CI\n\nand DePierre ensued, with the CI pressing for crack rather than\n\npowder and DePierre confirming that he could provide crack.                     In\n\nMarch, DePierre sold the CI 55.1 grams of crack.\n\n           Following     indictment,      DePierre      pled   to    one   firearms\n\ncharge, three other firearms charges were dismissed, and trial\n\nfollowed solely on the two drug charges.               Without denying the two\n\nsales, DePierre urged he had been entrapped, principally as to the\n\nsale of cocaine base.        The entrapment defense was submitted to the\n\njury,   which    after   a   four-day    trial    rejected     the    defense   and\n\nconvicted DePierre on both charges.            The judge sentenced DePierre\n\nto ten years in prison, the statutory minimum for a sale of 50 or\n\nmore grams of cocaine base. DePierre now contests only the cocaine\n\nbase conviction and the ultimate sentence, albeit on several\n\ndifferent grounds.\n\n           DePierre's main contention on appeal relates to the\n\ndistinction between crack and cocaine base, critical at sentencing,\n\nbut we start with DePierre's conviction.               Here, he claims that the\n\njudge misinstructed the jury on his substantive entrapment defense\n\nand, relatedly, that the judge erred at sentencing in rejecting\n\nDePierre's      counterpart    claim    that     the   government     engaged   in\n\n\n                                        -3-\nsentencing factor manipulation. Both arguments rest on the premise\n\nthat DePierre sought only to sell powder cocaine but was wrongfully\n\ninduced to sell crack.\n\n          Although     DePierre   does    not   say   that   the   evidence\n\ncompelled the jury to accept the defense, a description of the\n\nevidence on both sides provides context for the misinstruction\n\nclaim.   DePierre had in his favor the facts that he initially\n\ndelivered powder cocaine and that further contacts had to be made\n\nby the CI before crack was procured.       One of the government agents\n\ntestified candidly that he sent the CI back to renew his efforts\n\nprecisely in order to see whether DePierre could be drawn into a\n\nsale of crack, carrying with it the prospect of a higher sentence.\n\n          It may be this express admission that prompted the judge\n\nto submit to the jury the entrapment claim, an obligation that\n\nexists only where there is record evidence that \"fairly supports\"\n\nthe claim.    United States v. Rodriguez, 858 F.2d 809, 812-14 (1st\n\nCir. 1988).    Whether this is such a case may be debated--there is\n\nno rule that the agent must stop with the first crime--but it is\n\nhard to fault the trial judge for avoiding the risk that an\n\nappellate court might say later that the issue should have been\n\nleft to the jury.\n\n          Under     the   precedents,    once   the   defendant    makes   a\n\npreliminary showing, the burden shifts to the government to prove\n\nbeyond a reasonable doubt one of two things, either of which\n\n\n                                   -4-\ndefeats the defense: that the government did not wrongfully induce\n\nthe accused to engage in criminal conduct or that the accused had\n\na predisposition to engage in such conduct absent the inducement.\n\nMathews v. United States, 485 U.S. 58, 63 (1988); Rodriguez, 858\n\nF.2d at 812, 814-15. Given the burden-shifting, the term \"defense\"\n\nmay be thought to understate the government's full burden.\n\n           However, in practical terms the defense is difficult for\n\nthe defendant because the threshold that must be met to show\n\nwrongful inducement is a high one.            By their nature, \"stings\" and\n\nother such long-permitted operations of law enforcement do \"induce\"\n\ncrimes, if that word is used in its lay sense.            But it is settled\n\nthat only undue pressure or encouragement are forbidden.                United\n\nStates v. Rogers, 102 F.3d 641, 645 (1st Cir. 1996); United States\n\nv. Acosta, 67 F.3d 334, 337-38 (1st Cir. 1995).            The reasons, see\n\ngenerally United States v. Gendron, 18 F.3d 955, 961-62 (1st Cir.\n\n1994) (Breyer, C.J.), are too familiar to require repetition.\n\n           In this instance, the jury could easily reject the\n\nentrapment defense for lack of impropriety, because of propensity\n\nor both.   If the CI were credited, DePierre's initial call was a\n\np